       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANAGRAM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SUBJECT PIC X(20).
       01 WS-CANDIDATES-COUNT PIC 9.
       01 WS-CANDIDATES-TABLE.
           02 WS-CANDIDATES OCCURS 1 TO 20
                            DEPENDING ON WS-CANDIDATES-COUNT.
              05 WS-CANDIDATE PIC X(20).
       01 WS-RESULT-LIST PIC X(48).
       01 WS-SUBJECT-SORTED PIC X(20).
       01 WS-CANDIDATE-SORTED PIC X(20).
       01 WS-INDEX PIC 9(2).
       LOCAL-STORAGE SECTION.
       01 LS-LENGTH PIC 9(2).
       01 LS-TEMP-CHAR PIC X.
       01 LS-STRING PIC X(20).
       01 LS-INDEX PIC 9(2).

       PROCEDURE DIVISION.

       FIND-ANAGRAMS.
           PERFORM INITIALIZE-RESULT-LIST
           MOVE WS-SUBJECT TO LS-STRING
           PERFORM SORT-STRING
           MOVE LS-STRING TO WS-SUBJECT-SORTED
           PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > WS-CANDIDATES-COUNT
               MOVE WS-CANDIDATES(WS-INDEX) TO LS-STRING
               PERFORM SORT-STRING
               MOVE LS-STRING TO WS-CANDIDATE-SORTED
               IF WS-CANDIDATE-SORTED = WS-SUBJECT-SORTED
                   STRING WS-CANDIDATES(WS-INDEX) DELIMITED BY SPACE
                          "," DELIMITED BY SIZE
                          INTO WS-RESULT-LIST
               END-IF
           END-PERFORM
           STOP RUN.

       INITIALIZE-RESULT-LIST.
           MOVE SPACES TO WS-RESULT-LIST.

       SORT-STRING.
           PERFORM VARYING LS-INDEX FROM 1 BY 1 UNTIL LS-INDEX = LENGTH OF LS-STRING
               PERFORM VARYING LS-LENGTH FROM LS-INDEX BY 1 UNTIL LS-LENGTH > LENGTH OF LS-STRING
                   IF LS-STRING(LS-INDEX:1) > LS-STRING(LS-LENGTH:1)
                       MOVE LS-STRING(LS-INDEX:1) TO LS-TEMP-CHAR
                       MOVE LS-STRING(LS-LENGTH:1) TO LS-STRING(LS-INDEX:1)
                       MOVE LS-TEMP-CHAR TO LS-STRING(LS-LENGTH:1)
                   END-IF
               END-PERFORM
           END-PERFORM.
